Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisViewUpdateSurfaces Property

---

"Update Surfaces"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisViewUpdateSurfaces { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisViewUpdateSurfaces As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewUpdateSurfaces {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisViewUpdateSurfaces : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace